kayrozen/esp-glow/firmware/sdkconfig.defaults
# sdkconfig.defaults for esp-glow (ESP32-S3 + octal PSRAM).
#
# These defaults are applied at `idf.py set-target esp32s3` time. Override
# per-board values in sdkconfig (generated) or by editing this file.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash & partitioning ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Octal PSRAM (ESP32-S3) ---
# The pixel buffers and the loaded SHW1 bundle live in PSRAM. Octal mode gives
# the bandwidth the render loop needs at 44 Hz with multiple universes.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- C++ runtime ---
# The core modules were written for -fno-exceptions -fno-rtti (std::vector on
# alloc failure aborts; that is acceptable with PSRAM available). The flags
# themselves are enforced in components/glow_core/CMakeLists.txt via
# target_compile_options, because sdkconfig only exposes RTTI via
# CONFIG_COMPILER_RTTI (default off) and exceptions via
# CONFIG_COMPILER_CXX_EXCEPTIONS (default off). We pin both off here too.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_RTTI=n

# --- WiFi (station + softAP) ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# AMPDU RX (block-ack aggregation) has been observed to cause stalls and
# intermittent Art-Net/OSC UDP loss against 802.11ax (WiFi 6) access points
# -- the ESP32-S3 driver's reorder-buffer handling doesn't line up with some
# WiFi 6 APs' aggregation behavior, and the symptom (packets stop, then
# resume in a burst) reads just like the modem-sleep issue this project
# already works around in wifi_manager.cpp's WIFI_PS_NONE call, but with no
# reconnect telemetry to point at it. AMPDU RX is compile-time only (no
# runtime esp_wifi_* toggle exists), so it's disabled here rather than in
# code. This is a field-robustness fix, not a home-network workaround --
# the whole point is not knowing in advance what router a venue runs. See
# BENCH_RUNBOOK.md's "Known constraints" for the field notes. AMPDU TX is
# left enabled; only RX reassembly was implicated.
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# --- lwIP / sockets ---
CONFIG_LWIP_TCP=y
CONFIG_LWIP_UDP=y
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_SOCKETS=16

# --- HTTP server (WebSocket endpoint + console serving in F4) ---
# CONFIG_HTTPD_WS_SUPPORT gates ALL of esp_http_server's websocket API
# (httpd_ws_frame_t, HTTPD_WS_TYPE_*, httpd_ws_recv_frame/send_frame[_async],
# httpd_uri_t::is_websocket) behind #ifdef in esp_http_server.h -- without
# it, web_input.cpp's /ws handler fails to compile, not just to link.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# --- mbedTLS (OTA over HTTPS in F5) ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# --- OTA (F5: A/B rollback) ---
# The real Kconfig symbol is bootloader-scoped (this is a bootloader
# feature, not an app one) -- CONFIG_APP_ROLLBACK_ENABLE alone is not a
# real option and idf.py silently ignores it. This is what actually makes
# "the bootloader rolls back an image that crashes before being marked
# valid" happen (see ota_manager.h for the app-level half: mandatory
# self-validation before esp_ota_mark_app_valid_cancel_rollback()).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Task watchdog (F5 robustness) ---
# CONFIG_ESP_TASK_WDT (already present pre-F5) both enables the Task WDT
# component and initializes it at startup. CONFIG_ESP_TASK_WDT_PANIC is the
# part that actually reboots the board on timeout -- without it, a TWDT trip
# just logs which tasks stalled and the device keeps running frozen. See
# render_task.cpp for the render task's subscription (esp_task_wdt_add) and
# main.cpp's render_tick_hooks for the per-frame reset (esp_task_wdt_reset).
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# --- Core dump (F5: panic -> flash -> pull with espcoredump.py) ---
# The "coredump" partition (partitions.csv) is where this actually lands;
# without ENABLE_TO_FLASH a panic still reboots (see the Task WDT config
# above) but leaves no backtrace to pull afterward.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# --- Core affinity (WiFi/DMX coexistence) ---
# The render task pins itself to core 1 at runtime (xTaskCreatePinnedToCore).
# Keep WiFi/lwIP on core 0 so DMX timing on core 1 is never starved.
CONFIG_ESP_WIFI_TASK_CORE_AFFINITY_0=y
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y

# --- Main task stack ---
# ESP-IDF's default (3584 bytes) assumes app_main() spawns other tasks and
# returns/idles -- ours never returns (app_main ends in an infinite loop)
# and does real synchronous work on this stack for the life of the device:
# driver bring-up, show-bundle parsing (FixtureProfile is 3710 bytes and
# travels by value through Show::patchCommon -- one patch() call alone is
# most of the default budget), and Lua/Fennel VM init (setup_lua, a
# recursive-descent compiler compiling itself plus boot.fnl). First
# actually exercised by tests/qemu/ (nothing has run on hardware before
# this project's QEMU bring-up) -- it overflowed immediately. 16 KB is a
# generous starting point, not a measured minimum; see main.cpp's
# GLOW-TEST: stack telemetry (CONFIG_GLOW_SELFTEST) for the real
# high-water mark to size this against.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
